AWS/9th_try/rss_rps_rfs_1_0_0/ipvs_cpu16_0.log
podnum=1
Start time: 1506059666
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.65ms  228.28ms   1.99s    89.92%
    Req/Sec   470.16    387.81     4.05k    80.08%
  363425 requests in 30.05s, 85.59MB read
  Socket errors: connect 0, read 365, write 355, timeout 85
Requests/sec:  12093.07
Transfer/sec:      2.85MB
End time: 1506059696

podnum=2
Start time: 1506059871
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   152.37ms  308.75ms   2.00s    85.24%
    Req/Sec   606.71    316.61     3.04k    76.56%
  690230 requests in 30.04s, 162.56MB read
  Socket errors: connect 0, read 0, write 80, timeout 251
Requests/sec:  22980.79
Transfer/sec:      5.41MB
End time: 1506059901

podnum=4
Start time: 1506060075
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   141.21ms  248.19ms   1.95s    83.52%
    Req/Sec     1.13k   417.66     7.71k    89.96%
  1338924 requests in 30.02s, 315.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:  44593.80
Transfer/sec:     10.50MB
End time: 1506060105

podnum=6
Start time: 1506060280
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.67ms  105.98ms   2.00s    88.34%
    Req/Sec     1.23k   205.86     1.98k    69.24%
  1464283 requests in 30.02s, 344.87MB read
  Socket errors: connect 0, read 0, write 0, timeout 18
Requests/sec:  48772.98
Transfer/sec:     11.49MB
End time: 1506060310

podnum=8
Start time: 1506060484
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    53.08ms  117.26ms   2.00s    90.17%
    Req/Sec     1.23k   301.35     3.91k    82.02%
  1464675 requests in 30.02s, 344.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 13
Requests/sec:  48784.32
Transfer/sec:     11.49MB
End time: 1506060514

podnum=10
Start time: 1506060689
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.19ms  107.97ms   2.00s    89.35%
    Req/Sec     1.23k   258.39     3.21k    77.39%
  1464629 requests in 30.02s, 344.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 26
Requests/sec:  48782.86
Transfer/sec:     11.49MB
End time: 1506060719

podnum=12
Start time: 1506060894
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    54.79ms  122.98ms   1.96s    90.60%
    Req/Sec     1.24k   414.39    29.86k    89.16%
  1467928 requests in 30.10s, 345.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 73
Requests/sec:  48772.59
Transfer/sec:     11.49MB
End time: 1506060924

podnum=14
Start time: 1506061099
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    51.24ms   99.60ms   2.00s    87.59%
    Req/Sec     1.23k   221.23     3.82k    68.93%
  1464572 requests in 30.03s, 344.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 10
Requests/sec:  48772.47
Transfer/sec:     11.49MB
End time: 1506061129

podnum=16
Start time: 1506061304
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.69ms   90.66ms   2.00s    87.52%
    Req/Sec     1.23k   216.44     2.05k    70.63%
  1464848 requests in 30.02s, 345.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:  48788.25
Transfer/sec:     11.49MB
End time: 1506061334

podnum=18
Start time: 1506061508
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.80ms   94.20ms   1.97s    87.83%
    Req/Sec     1.23k   203.02     2.01k    67.87%
  1464853 requests in 30.02s, 345.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 14
Requests/sec:  48791.22
Transfer/sec:     11.49MB
End time: 1506061538

podnum=20
Start time: 1506061713
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.89ms   92.48ms   1.78s    87.58%
    Req/Sec     1.23k   206.81     2.27k    68.50%
  1464792 requests in 30.02s, 344.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 7
Requests/sec:  48788.68
Transfer/sec:     11.49MB
End time: 1506061743

podnum=25
Start time: 1506061918
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.40ms   89.37ms   1.95s    86.92%
    Req/Sec     1.23k   307.11    27.01k    87.91%
  1467556 requests in 30.10s, 345.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
Requests/sec:  48763.47
Transfer/sec:     11.48MB
End time: 1506061948

podnum=30
Start time: 1506062123
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.10ms   91.78ms   1.78s    87.84%
    Req/Sec     1.23k   255.94     3.48k    75.61%
  1465151 requests in 30.02s, 345.41MB read
  Socket errors: connect 0, read 0, write 1, timeout 10
Requests/sec:  48805.21
Transfer/sec:     11.51MB
End time: 1506062154

podnum=35
Start time: 1506062329
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.33ms   93.43ms   1.95s    87.56%
    Req/Sec     1.23k   200.99     1.97k    68.05%
  1464693 requests in 30.02s, 345.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
Requests/sec:  48787.84
Transfer/sec:     11.50MB
End time: 1506062359

podnum=40
Start time: 1506062535
wrk -c800 -t40 -d30s http://172.16.60.2:8888/
Running 30s test @ http://172.16.60.2:8888/
  40 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.92ms   87.79ms   1.90s    86.56%
    Req/Sec     1.23k   197.21     1.93k    67.86%
  1464504 requests in 30.02s, 345.52MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:  48784.17
Transfer/sec:     11.51MB
End time: 1506062565